Revit 2027 API
ViewSheet.DeleteViewport Method
 Removes a viewport from the sheet by deleting it from the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DeleteViewport(
	Viewport viewport
)
Public Sub DeleteViewport (
	viewport As Viewport
)
public:
void DeleteViewport(
	Viewport^ viewport
)
member DeleteViewport :
        viewport : Viewport -> unit
Parameters
viewport Viewport
 The viewport that will be deleted and removed from the sheet.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace